Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: No Database Selected
fr: Aucune base de données sélectionnée
ko: 선택된 데이터베이스 없음
tr: Veritabanı Seçilmedi
vi: Chưa chọn cơ sở dữ liệu
zh_hans: 未选择数据库
zh_hant: 未選擇資料庫

source: No matches to replace.
fr: Aucun match à remplacer.

source: Not Compared
fr: Pas comparé
ko: 비교하지 않음
tr: Karşılaştırılmadı
vi: Chưa so sánh
zh_hans: 未比较
zh_hant: 未比較

source: Could not start a new TablePro instance. Quit and reopen manually.
fr: Impossible de démarrer une nouvelle instance de TablePro. Quitter et rouvrir manuellement.
ko: 새 TablePro 인스턴스를 시작할 수 없습니다. 앱을 종료한 후 직접 다시 여십시오.
tr: Yeni bir TablePro örneği başlatılamadı. Uygulamadan çıkıp elle yeniden açın.
vi: Không thể khởi chạy phiên TablePro mới. Hãy thoát và mở lại thủ công.
zh_hans: 无法启动新的TablePro实例。请手动退出并重新打开。
zh_hant: 無法啟動新的 TablePro 實例。請手動結束並重新開啟。

source: Trusted Plugin Developers
fr: Développeurs de plugins de confiance
ko: 신뢰하는 플러그인 개발자
tr: Güvenilen Eklenti Geliştiricileri
vi: Nhà phát triển plugin được tin cậy
zh_hans: 已信任的插件开发者
zh_hant: 已信任的外掛開發者

source: Writes %lld files, one for each database.
fr: Écrit des fichiers %lld, un pour chaque base de données.

source: Get Connection Status
fr: Obtenir l'état de la connexion
ko: 연결 상태 확인
tr: Bağlantı Durumunu Al
vi: Lấy trạng thái kết nối
zh_hans: 获取连接状态
zh_hant: 取得連線狀態

source: %lld row(s) affected
fr: %lld rang(s) affecté(s)
ko: %lld개 행에 영향
tr: %lld satır etkilendi
vi: %lld dòng bị ảnh hưởng
zh_hans: %lld 行受影响
zh_hant: 已影響 %lld 列

source: Schema the routine lives in
fr: Schéma dans lequel la routine vit
ko: 루틴이 속한 스키마
tr: Rutinin içinde bulunduğu şema
vi: Schema chứa routine
zh_hans: 该例程所在的 Schema
zh_hant: 該常式所在的綱要

source: Cache Size
fr: Taille de la cache
ko: 캐시 크기
tr: Önbellek Boyutu
vi: Kích thước cache
zh_hans: 缓存大小
zh_hant: 快取大小

source: Whether it can log in
fr: Que cela puisse se connecter
ko: 로그인할 수 있는지 여부
tr: Oturum açıp açamayacağı
vi: Có đăng nhập được hay không
zh_hans: 是否可以登录
zh_hant: 是否可以登入

source: Values from %d loaded rows
fr: Valeurs de %d lignes chargées
ko: 불러온 행 %d개의 값
tr: Yüklenen %d satırdan gelen değerler
vi: Giá trị từ %d dòng đã tải
zh_hans: 来自已加载的 %d 行的值
zh_hant: 來自已載入的 %d 列的值

source: Could not export the diagram
fr: Impossible d'exporter le diagramme
ko: 다이어그램을 내보낼 수 없습니다
tr: Diyagram dışa aktarılamadı
vi: Không thể xuất sơ đồ
zh_hans: 无法导出图表
zh_hant: 無法匯出圖表

source: Engine
fr: Moteur
ko: 엔진
tr: Motor

source: Show recent connections
fr: Afficher les connexions récentes
ko: 최근 연결 보기
tr: Son bağlantıları göster
vi: Hiện kết nối gần đây
zh_hans: 显示最近的连接
zh_hant: 顯示最近的連線

source: Previous Result
fr: Résultat précédent
ko: 이전 결과
tr: Önceki Sonuç
vi: Kết quả trước
zh_hans: 上一个结果
zh_hant: 上一個結果

source: Sorting will reload data and discard all unsaved changes.
fr: Le tri rechargera les données et rejettera toutes les modifications non enregistrées.
ko: 정렬하면 데이터를 다시 불러오고 저장하지 않은 모든 변경 사항이 폐기됩니다.
tr: Sıralama verileri yeniden yükler ve kaydedilmemiş tüm değişiklikleri siler.
vi: Sắp xếp sẽ tải lại dữ liệu và hủy tất cả thay đổi chưa lưu.
zh_hans: 排序将重新加载数据并丢弃所有未保存的更改。
zh_hant: 排序將重新載入資料並捨棄所有未儲存的變更。

source: Rows Where %@
fr: Lignes Où %@

source: Privilege
fr: Privilège
ko: 권한
tr: Yetki
vi: Quyền
zh_hans: 权限
zh_hant: 權限

source: Load
fr: Charge
ko: 불러오기
tr: Yükle
vi: Tải
zh_hans: 加载
zh_hant: 載入

source: Tablespace
fr: Espace de table
ko: 테이블스페이스
zh_hans: 表空间
zh_hant: 資料表空間

source: Enable %@
fr: Activer %@
ko: %@ 활성화
tr: %@ Etkinleştir
vi: Bật %@
zh_hans: 启用 %@
zh_hant: 啟用 %@

source: No Data
fr: Pas de données
ko: 데이터 없음
tr: Veri Yok
vi: Không có dữ liệu
zh_hans: 无数据
zh_hant: 無資料

source: Default token
fr: Token par défaut
ko: 기본 토큰
tr: Varsayılan token
vi: Token mặc định
zh_hans: 默认令牌
zh_hant: 預設權杖

source: Select a table to copy its structure:
fr: Sélectionnez une table pour copier sa structure :
ko: 구조를 복사할 테이블 선택:
vi: Chọn bảng để sao chép cấu trúc:
zh_hans: 选择要复制结构的表：
zh_hant: 選擇要複製結構的資料表：

source: The source and the target are the same database.
fr: La source et la cible sont la même base de données.
ko: 원본과 대상이 같은 데이터베이스입니다.
tr: Kaynak ve hedef aynı veritabanı.
vi: Nguồn và đích là cùng một cơ sở dữ liệu.
zh_hans: 来源和目标是同一个数据库。
zh_hant: 來源和目標是同一個資料庫。

source: Connection lost
fr: Connexion perdue
ko: 연결 끊김
tr: Bağlantı kesildi
vi: Mất kết nối
zh_hans: 连接丢失
zh_hant: 連線中斷

source: Table rebuild
fr: Réconstruction de la table
ko: 테이블 재생성
tr: Tablo yeniden oluşturma
vi: Dựng lại bảng
zh_hans: 重建表
zh_hant: 重建資料表

source: An operation is already running.
fr: Une opération est déjà en cours.
ko: 이미 작업이 실행 중입니다.
tr: Zaten bir işlem yürütülüyor.
vi: Một thao tác đang chạy.
zh_hans: 已有操作正在运行。
zh_hant: 已有操作正在執行。

source: Underline
fr: Souligner
ko: 밑줄
tr: Altı Çizili
vi: Gạch chân
zh_hans: 下划线
zh_hant: 底線

source: Export %1$lld row to %2$@
fr: Exporter la ligne %1$lld vers %2$@

source: UUID of the connection to disconnect
fr: UUID de la connexion à déconnecter
ko: 연결을 해제할 연결의 UUID
tr: Bağlantısı kesilecek bağlantının UUID'si
vi: UUID của kết nối cần ngắt
zh_hans: 要断开的连接的 UUID
zh_hant: 要中斷的連線的 UUID

source: MySQL and MariaDB. Drops the account a view was created under. The importing account becomes the definer, so the view runs with its privileges. An account the target server does not have makes the import fail.
fr: MySQL et MariaDB. Supprime le compte sous lequel une vue a été créée. Le compte d'importation devient le définisseur, de sorte que la vue fonctionne avec ses privilèges. Un compte que le serveur cible n'a pas provoque l'échec de l'importation.
ko: MySQL 및 MariaDB. 뷰를 만든 계정을 제외합니다. 가져오는 계정이 정의자가 되므로 뷰는 해당 계정의 권한으로 실행됩니다. 대상 서버에 없는 계정은 가져오기를 실패하게 만듭니다.
tr: MySQL ve MariaDB. Görünümün oluşturulduğu hesabı çıkarır. İçe aktaran hesap tanımlayıcı olur, böylece görünüm o hesabın ayrıcalıklarıyla çalışır. Hedef sunucuda bulunmayan bir hesap içe aktarmayı başarısız kılar.
vi: MySQL và MariaDB. Bỏ tài khoản đã tạo view. Tài khoản nhập dữ liệu trở thành người định nghĩa, nên view chạy với quyền của tài khoản đó. Tài khoản không có trên máy chủ đích sẽ làm việc nhập thất bại.
zh_hans: MySQL 和 MariaDB。移除创建视图所用的账户。导入的账户成为定义者，视图将以该账户的权限运行。目标服务器上不存在的账户会导致导入失败。
zh_hant: MySQL 和 MariaDB。移除建立檢視表所用的帳戶。匯入的帳戶會成為定義者，檢視表將以該帳戶的權限執行。目標伺服器上不存在的帳戶會導致匯入失敗。

source: Non-ASCII space (%@). SQL needs an ASCII space (U+0020).
fr: Espace non ASCII (%@). SQL a besoin d'un espace ASCII (U+0020).
ko: ASCII가 아닌 공백(%@). SQL은 ASCII 공백(U+0020)만 인식합니다.
tr: ASCII olmayan boşluk (%@). SQL, ASCII boşluk (U+0020) bekler.
vi: Khoảng trắng không phải ASCII (%@). SQL cần khoảng trắng ASCII (U+0020).
zh_hans: 非 ASCII 空格（%@）。SQL 需要 ASCII 空格（U+0020）。
zh_hant: 非 ASCII 空格（%@）。SQL 需要 ASCII 空格（U+0020）。

source: Cluster Seed Nodes
fr: Nœuds de graines de cluster
ko: 클러스터 시드 노드
tr: Cluster Tohum Düğümleri
vi: Nút khởi tạo Cluster
zh_hans: 集群种子节点
zh_hant: 叢集種子節點

source: Object copies
fr: Copies d'objets

source: Details
fr: Détails
ko: 세부사항
tr: Ayrıntılar
vi: Chi tiết
zh_hans: 详情
zh_hant: 詳細資訊

source: Bundle ID:
fr: ID du paquet :
tr: Paket Kimliği:

source: %1$@ for %2$@, granted by another role
fr: %1$@ pour %2$@, accordé par un autre rôle

source: Reorder Columns
fr: Réorganiser les colonnes

source: Edit View Definition…
fr: Modifier la définition de la vue...
ko: 뷰 정의 편집…
tr: Görünüm Tanımını Düzenle…
vi: Sửa định nghĩa view…
zh_hans: 编辑视图定义…
zh_hant: 編輯檢視表定義…

source: Empty etcd command
fr: Commande empty etcd

source: Warnings
fr: Avertissements
ko: 경고
tr: Uyarılar
vi: Cảnh báo
zh_hans: 警告
zh_hant: 警告

source: Cannot use SSH Tunnel and Cloudflare Tunnel at the same time
fr: Il n'est pas possible d'utiliser le tunnel SSH et le tunnel Cloudflare en même temps.
ko: SSH 터널과 Cloudflare 터널은 동시에 사용할 수 없습니다
tr: SSH Tüneli ile Cloudflare Tüneli aynı anda kullanılamaz
vi: Không thể dùng SSH Tunnel và Cloudflare Tunnel cùng lúc
zh_hans: 不能同时使用SSH隧道和Cloudflare隧道
zh_hant: 無法同時使用 SSH 隧道與 Cloudflare 隧道

source: Schema List
fr: Liste de schémas
ko: 스키마 목록
tr: Şema Listesi
vi: Danh sách schema
zh_hans: Schema 列表
zh_hant: 綱要清單

source: Export Plan as Image
fr: Exporter le plan sous forme d'image
ko: 실행 계획을 이미지로 내보내기
tr: Planı Görüntü Olarak Dışa Aktar
vi: Xuất kế hoạch thành ảnh
zh_hans: 将执行计划导出为图片
zh_hant: 將執行計畫匯出為圖片

source: Progress estimated (%lld table could not be counted)
fr: %lld Progrès estimé (ble lld ne pouvait pas être compté)

source: Swap
fr: Échange
ko: 바꾸기
tr: Değiştir
vi: Hoán đổi
zh_hans: 互换
zh_hant: 互換

source: Failed to encode content as UTF-8
fr: Échec de l'encodage du contenu en UTF-8.
ko: 콘텐츠를 UTF-8로 인코딩하지 못했습니다
tr: İçerik UTF-8 olarak kodlanamadı
vi: Không thể mã hóa nội dung thành UTF-8
zh_hans: 无法将内容编码为 UTF-8
zh_hant: 無法將內容編碼為 UTF-8

source: ~/.pgpass not found
fr: ~/.pgpass introuvable
ko: ~/.pgpass 파일을 찾을 수 없음
tr: ~/.pgpass bulunamadı
vi: Không tìm thấy ~/.pgpass
zh_hans: 未找到 ~/.pgpass
zh_hant: 找不到 ~/.pgpass

source: Counting rows
fr: Compter les lignes
ko: 행 수 계산 중
tr: Satırlar sayılıyor
vi: Đang đếm dòng
zh_hans: 正在统计行数
zh_hant: 正在計算列數

source: Deactivated
fr: Désactivé
ko: 비활성화됨
tr: Devre Dışı
vi: Đã hủy kích hoạt
zh_hans: 已停用
zh_hant: 已停用

source: Result
fr: Résultat
ko: 결과
tr: Sonuç
vi: Kết quả
zh_hans: 结果
zh_hant: 結果

source: Add at least one column with a name and type
fr: Ajoutez au moins une colonne avec un nom et un type.
ko: 이름과 유형이 지정된 열을 하나 이상 추가하십시오
tr: En az bir ad ve türe sahip sütun ekleyin
vi: Thêm ít nhất một cột có tên và kiểu dữ liệu
zh_hans: 请至少添加一个包含名称和类型的列
zh_hant: 請至少新增一個含名稱與型別的欄位

source: Select SQL files to open
fr: Sélectionnez les fichiers SQL à ouvrir
ko: 열 SQL 파일 선택
tr: Açılacak SQL dosyalarını seç
vi: Chọn tệp SQL để mở
zh_hans: 选择要打开的 SQL 文件
zh_hant: 選擇要開啟的 SQL 檔案

source: Show Assistant
fr: Assistant de présentation

source: The source returned a body rather than a statement that recreates it.
fr: La source a renvoyé un corps plutôt qu'une déclaration qui le recrée.

source: Host looks like a socket path
fr: L'hôte ressemble à un chemin de socket
ko: 호스트가 소켓 경로인 것 같습니다
tr: Sunucu adı soket yoluna benziyor
vi: Máy chủ trông giống đường dẫn socket
zh_hans: 主机看起来像 socket 路径
zh_hant: 主機看起來像 socket 路徑

source: Comments and owners
fr: Commentaires et propriétaires
ko: 주석 및 소유자
tr: Yorumlar ve sahipler
vi: Chú thích và chủ sở hữu
zh_hans: 注释和所有者
zh_hant: 註解和擁有者

source: Linked Folders
fr: Dossiers liés
ko: 연결된 폴더
tr: Bağlantılı Klasörler
vi: Thư mục Liên kết
zh_hans: 链接文件夹
zh_hant: 已連結資料夾

source: Previous Page
fr: Page précédente
ko: 이전 페이지
tr: Önceki Sayfa
vi: Trang trước
zh_hans: 上一页
zh_hant: 上一頁

source: Hide Workspace Rail
fr: Cacher le rail de l'espace de travail
ko: 워크스페이스 레일 가리기
tr: Çalışma Alanı Şeridini Gizle
vi: Ẩn thanh không gian làm việc
zh_hans: 隐藏工作区栏
zh_hant: 隱藏工作區列

source: %@ could not be loaded
fr: %@ n'a pas pu être chargé
ko: %@ 로드 실패
tr: %@ yüklenemedi
vi: Không thể tải %@
zh_hans: 无法加载%@
zh_hant: 無法載入 %@

source: Delete "%@"
fr: Supprimer "%@"
ko: "%@" 삭제
tr: "%@" Sil
vi: Xóa "%@"
zh_hans: 删除「%@」
zh_hant: 刪除「%@」

source: Columnar format. Read by DuckDB, Spark, pandas and BigQuery.
fr: Format colonne. Lu par DuckDB, Spark, pandas et BigQuery.

source: Export completed with warnings
fr: Exportation terminée avec des avertissements

source: The column name “%@” contains %@, which %@ cannot store. Rename the column, or choose Save As and pick UTF-8.
fr: Le nom de la colonne "%@" contient %@, que %@ ne peut pas stocker. Renommez la colonne ou choisissez Enregistrer sous et sélectionnez UTF-8.

source: Line
fr: Queue
ko: 선
tr: Çizgi
vi: Đường
zh_hans: 折线
zh_hant: 折線

source: Output truncated for display
fr: Sortie tronquée pour l'affichage
ko: 화면에 표시하기 위해 출력이 잘렸습니다
tr: Çıktı görüntüleme için kısaltıldı
vi: Kết quả đầu ra bị cắt bớt để hiển thị
zh_hans: 输出已截断显示
zh_hant: 輸出已截斷顯示

source: This operation is not supported
fr: Cette opération n'est pas prise en charge.
ko: 이 작업은 지원되지 않습니다
tr: Bu işlem desteklenmiyor
vi: Thao tác này không được hỗ trợ
zh_hans: 不支持此操作
zh_hant: 不支援此操作

source: Show DDL
fr: Afficher DDL
ko: DDL 보기
tr: DDL'yi Göster
vi: Hiện DDL
zh_hans: 显示 DDL
zh_hant: 顯示 DDL

source: summarize
fr: résumer

source: MCP Server: Running
fr: Serveur MCP : En cours d'exécution
ko: MCP 서버: 실행 중
tr: MCP Sunucusu: Çalışıyor
vi: MCP Server: Đang chạy
zh_hans: MCP 服务器：运行中
zh_hant: MCP 伺服器：執行中

source: Clear saved changes
fr: Effacer les modifications enregistrées
ko: 저장된 변경 사항 지우기
tr: Kaydedilen değişiklikleri sil
vi: Xoá các thay đổi đã lưu
zh_hans: 清除已保存的更改
zh_hant: 清除已儲存的變更

source: Import Completed with Errors
fr: Importation terminée avec des erreurs
ko: 오류가 발생했지만 가져오기 완료
tr: İçe Aktarma Hatalarla Tamamlandı
vi: Nhập hoàn tất với lỗi
zh_hans: 导入完成但有错误
zh_hant: 匯入完成但有錯誤

source: Choose a source to compare from.
fr: Choisissez une source à partir de laquelle comparer.
ko: 비교할 원본을 선택하십시오.
tr: Karşılaştırmanın yapılacağı kaynağı seçin.
vi: Chọn nguồn để so sánh từ đó.
zh_hans: 选择作为比较起点的来源。
zh_hant: 選擇作為比較起點的來源。

source: Install it with “brew install mysql-client” and link it.
fr: Installez-le avec "brew install mysql-client" et l'associez.

source: Connect Securely
fr: Se connecter en toute sécurité
ko: 안전하게 연결
tr: Güvenle Bağlanın
vi: Kết nối an toàn
zh_hans: 安全连接
zh_hant: 安全連線

source: No matching tables
fr: Aucune table correspondante
ko: 일치하는 테이블 없음
vi: Không có bảng nào khớp
zh_hans: 无匹配表
zh_hant: 無符合的資料表

source: 1 (no batching)
fr: 1 (pas de regroupement)
ko: 1 (배치 처리 없음)
tr: 1 (toplu işlem yok)
vi: 1 (không gom nhóm)
zh_hans: 1（不分批）
zh_hant: 1（不分批）

source: Stop recording queries on this Mac
fr: Arrêtez d'enregistrer les requêtes sur ce Mac.
ko: 이 Mac에서 쿼리 기록 중지
tr: Bu Mac'te sorgu kaydını durdur
vi: Ngừng ghi truy vấn trên máy Mac này
zh_hans: 停止在这台 Mac 上记录查询
zh_hant: 停止在這台 Mac 上記錄查詢

source: Column to sort on
fr: Colonne à trier sur
ko: 정렬할 열
tr: Sıralanacak sütun
vi: Cột để sắp xếp
zh_hans: 用于排序的列
zh_hant: 用於排序的欄位

source: There are no connections to publish.
fr: Il n'y a pas de connexions à publier.
ko: 게시할 연결이 없습니다.
tr: Yayınlanacak bağlantı yok.
vi: Không có kết nối nào để xuất bản.
zh_hans: 没有可发布的连接。
zh_hant: 沒有可發佈的連線。

# %lld of ^[%lld row](inflect: true)
source: %1$lld of ^[%2$lld row](inflect: true)
fr: %1$lld de ^[%2$lld ligne](inflect: vrai)
ko: %1$lld/%2$lld행
tr: %lld / %lld satır
vi: %lld trên %lld dòng
zh_hans: %lld / %lld 行
zh_hant: %1$lld / %2$lld 列

source: Open System Settings
fr: Paramètres du système ouvert
ko: 시스템 설정 열기
tr: Sistem Ayarları'nı Aç
vi: Mở Cài đặt hệ thống
zh_hans: 打开系统设置
zh_hant: 打開系統設定

source: Could not generate SQL for changes.
fr: Impossible de générer SQL pour les modifications.
ko: 변경 사항에 대한 SQL을 생성할 수 없습니다.
tr: Değişiklikler için SQL oluşturulamadı.
vi: Không thể tạo SQL cho các thay đổi.
zh_hans: 无法为更改生成 SQL。
zh_hant: 無法為變更產生 SQL。

source: New Connection…
fr: Nouvelle connexion...
ko: 새 연결…
tr: Yeni Bağlantı…
vi: Kết nối mới…
zh_hans: 新建连接…
zh_hant: 新增連線…

source: Execute a query to chart its loaded rows.
fr: Exécutez une requête pour tracer ses lignes chargées.
ko: 쿼리를 실행하면 불러온 행을 차트로 그립니다.
tr: Yüklenen satırları grafikte göstermek için bir sorgu çalıştırın.
vi: Chạy truy vấn để vẽ biểu đồ từ các hàng đã tải.
zh_hans: 执行查询以绘制已加载行的图表。
zh_hant: 執行查詢以繪製已載入列的圖表。

source: This Oracle server is older than release 11.1, which the database driver does not support.
fr: Ce serveur Oracle est plus ancien que la version 11.1, que le pilote de base de données ne prend pas en charge.
ko: 이 Oracle 서버는 릴리스 11.1보다 이전 버전이며 데이터베이스 드라이버에서 지원하지 않습니다.
tr: Bu Oracle sunucusu, veritabanı sürücüsünün desteklemediği 11.1 sürümünden daha eski.
vi: Máy chủ Oracle này cũ hơn bản 11.1, phiên bản mà driver cơ sở dữ liệu không hỗ trợ.
zh_hans: 此 Oracle 服务器早于 11.1 版，数据库驱动不支持。
zh_hant: 此 Oracle 伺服器早於 11.1 版，資料庫驅動程式不支援。

source: Make the target the source and the source the target
fr: Faites de la cible la source et de la source la cible.
ko: 대상을 원본으로, 원본을 대상으로 바꿉니다
tr: Hedefi kaynak, kaynağı hedef yap
vi: Đổi đích thành nguồn và nguồn thành đích
zh_hans: 把目标变成来源，把来源变成目标
zh_hant: 把目標變成來源，把來源變成目標

source: '%@' has no primary key, so the row is found by matching every column. Another client may have changed it, or a value in it cannot be compared. Your edit is still here.
fr: «%@» n’a pas de clé primaire, donc la ligne est trouvée en faisant correspondre chaque colonne. Un autre client l’a peut-être modifiée, ou une valeur qu’elle contient ne peut pas être comparée. Votre modification est toujours là.

source: Applying or clearing filters will reload data and discard all unsaved changes.
fr: L'application ou la suppression des filtres rechargeront les données et rejeteront toutes les modifications non enregistrées.
ko: 필터를 적용하거나 지우면 데이터를 다시 불러오고 저장하지 않은 모든 변경 사항이 폐기됩니다.
tr: Filtre uygulamak veya temizlemek veriyi yeniden yükler ve tüm kaydedilmemiş değişiklikleri siler.
vi: Áp dụng hoặc xóa bộ lọc sẽ tải lại dữ liệu và hủy tất cả thay đổi chưa lưu.
zh_hans: 应用或清除筛选条件将重新加载数据并丢弃所有未保存的更改。
zh_hant: 套用或清除篩選條件將重新載入資料並捨棄所有未儲存的變更。

source: Loading more rows
fr: Chargement de plus de lignes
ko: 행을 더 불러오는 중
tr: Daha fazla satır yükleniyor
vi: Đang tải thêm hàng
zh_hans: 正在载入更多行
zh_hant: 正在載入更多列

source: Create table %@
fr: Créer une table %@
ko: 테이블 %@ 생성
tr: %@ tablosunu oluştur
vi: Tạo bảng %@
zh_hans: 创建表 %@
zh_hant: 建立資料表 %@

source: MCP Server: Starting...
fr: Serveur MCP : Commencement...
ko: MCP 서버: 시작 중...
tr: MCP Sunucusu: Başlatılıyor...
vi: MCP Server: Đang khởi động...
zh_hans: MCP 服务器：正在启动…
zh_hant: MCP 伺服器：正在啟動…

source: New Connection
fr: Nouvelle connexion
ko: 새 연결
tr: Yeni Bağlantı
vi: Kết nối mới
zh_hans: 新建连接
zh_hant: 新增連線

source: The previous code wasn't accepted. Wait for your authenticator to refresh, then enter the new code.
fr: Le code précédent n'a pas été accepté. Attendez que votre authentificateur se rafraîchie, puis entrez le nouveau code.
ko: 이전 코드는 승인되지 않았습니다. 인증 앱이 새로 고침될 때까지 기다린 다음 새 코드를 입력하십시오.
tr: Önceki kod kabul edilmedi. Kimlik doğrulayıcınızın yenilenmesini bekleyin, ardından yeni kodu girin.
vi: Mã trước đó không được chấp nhận. Chờ ứng dụng xác thực làm mới rồi nhập mã mới.
zh_hans: 上一个验证码未被接受。请等待验证器刷新后输入新验证码。
zh_hant: 上一個驗證碼未被接受。請等待你的驗證器重新整理後，再輸入新的驗證碼。

source: Find tables and columns whose name contains a substring, so a column can be located without describing every table.
fr: Trouvez des tables et des colonnes dont le nom contient une sous-chaîne, afin qu'une colonne puisse être localisée sans décrire chaque table.
ko: 이름에 특정 부분 문자열이 들어간 테이블과 열을 찾아, 모든 테이블을 설명하지 않고도 열을 찾을 수 있게 합니다.
tr: Adı bir alt dize içeren tabloları ve sütunları bulur, böylece her tabloyu açıklamadan bir sütun bulunabilir.
vi: Tìm các bảng và cột có tên chứa một chuỗi con, để tìm được một cột mà không cần mô tả mọi bảng.
zh_hans: 查找名称包含某个子串的表和列，这样不必描述每一张表也能定位到某个列。
zh_hant: 尋找名稱包含某個子字串的資料表和欄位，這樣不必描述每一張資料表也能定位到某個欄位。

source: Duplicate Database
fr: Base de données en double

source: No Check Constraints
fr: Pas de contraintes de vérification
ko: CHECK 제약 조건 없음
tr: Kontrol Kısıtlaması Yok
vi: Không có ràng buộc kiểm tra
zh_hans: 无检查约束
zh_hant: 無檢查約束

source: Switch Schema
fr: Schéma de commutation
ko: 스키마 전환
tr: Şema Değiştir
vi: Chuyển schema
zh_hans: 切换 Schema
zh_hant: 切換綱要

source: Install the CLI client for %@
fr: Installez le client CLI pour %@
ko: %@용 CLI 클라이언트 설치
tr: %@ için CLI istemcisini yükleyin
vi: Cài đặt CLI client cho %@
zh_hans: 安装 %@ 的 CLI 客户端
zh_hant: 安裝 %@ 的 CLI 用戶端

source: Signed in with Cursor
fr: Connecté avec Cursor
ko: Cursor로 로그인됨
tr: Cursor ile giriş yapıldı
vi: Đã đăng nhập bằng Cursor
zh_hans: 已使用 Cursor 登录
zh_hant: 已使用 Cursor 登入

source: Click to load models
fr: Cliquez pour charger les modèles
ko: 모델을 불러오려면 클릭하십시오
tr: Modelleri yüklemek için tıklayın
vi: Nhấp để tải danh sách model
zh_hans: 点击加载模型
zh_hant: 點按以載入模型

source: This user can grant this privilege to others.
fr: Cet utilisateur peut accorder ce privilège à d'autres personnes.
ko: 이 사용자는 다른 사용자에게 이 권한을 부여할 수 있습니다.
tr: Bu kullanıcı bu yetkiyi başkalarına verebilir.
vi: Người dùng này có thể cấp quyền đó cho người khác.
zh_hans: 此用户可以将该权限授予他人。
zh_hant: 此使用者可以將該權限授予他人。

source: Edit Data in Place
fr: Modifier les données sur place
ko: 그 자리에서 데이터 편집
tr: Verileri Yerinde Düzenleyin
vi: Chỉnh sửa dữ liệu tại chỗ
zh_hans: 就地编辑数据
zh_hant: 就地編輯資料

source: Save
fr: Économiser
ko: 저장
tr: Kaydet
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

source: Updated %@ rows
fr: Lignes %@ mises à jour
ko: %@개 행 업데이트됨
tr: %@ satır güncellendi
vi: Đã cập nhật %@ dòng
zh_hans: 已更新 %@ 行
zh_hant: 已更新 %@ 列

source: Toggle Agent Mode
fr: Changer le mode agent

source: Column names in result order
fr: Noms des colonnes dans l'ordre des résultats
ko: 결과 순서대로 나열한 열 이름
tr: Sonuç sırasına göre sütun adları
vi: Tên cột theo thứ tự kết quả
zh_hans: 按结果顺序排列的列名
zh_hant: 按結果順序排列的欄位名稱

source: v%@ ready to activate
fr: v%@ prêt à être activé
ko: v%@ 활성화 준비됨
tr: v%@ etkinleştirilmeye hazır
vi: v%@ sẵn sàng kích hoạt
zh_hans: v%@ 准备就绪，可激活
zh_hant: v%@ 已就緒，可啟用

source: Clear Table
fr: Table vide

source: Not on this page
fr: Pas sur cette page
ko: 이 페이지에 없음
tr: Bu sayfada değil
vi: Không có ở trang này
zh_hans: 不在本页
zh_hant: 不在本頁

source: License Not Recognized
fr: Licence non reconnue
ko: 라이선스를 인식할 수 없습니다
tr: Lisans tanınmadı
vi: Không nhận ra giấy phép
zh_hans: 无法识别此许可证
zh_hant: 無法識別此授權

source: %@ connections open a server, not a database file, so there is nothing to fetch over SSH.
fr: Les connexions %@ ouvrent un serveur, pas un fichier de base de données, donc il n'y a rien à récupérer via SSH.
ko: %@ 연결은 데이터베이스 파일이 아니라 서버를 여는 것이므로 SSH로 가져올 것이 없습니다.
tr: %@ bağlantıları bir veritabanı dosyasını değil bir sunucuyu açar, bu yüzden SSH üzerinden alınacak bir şey yok.
vi: Kết nối %@ mở một máy chủ chứ không phải tệp cơ sở dữ liệu, nên không có gì để tải qua SSH.
zh_hans: %@ 连接打开的是服务器而不是数据库文件，因此没有内容需要通过 SSH 获取。
zh_hant: %@ 連線開啟的是伺服器而不是資料庫檔案，因此沒有內容需要透過 SSH 取得。

source: Copy ID
fr: Copie d'identité
ko: ID 복사
tr: ID Kopyala
vi: Sao chép ID
zh_hans: 复制 ID
zh_hant: 複製 ID

source: Add tags
fr: Ajouter des balises
ko: 태그 추가
tr: Etiket ekle
vi: Thêm thẻ
zh_hans: 添加标签
zh_hant: 新增標籤

source: Queued
fr: En file d'attente

source: Search the query history TablePro keeps on this Mac. Results cover only connections this client may reach, whether or not connection_id is given.
fr: Recherchez dans l'historique des requêtes. TablePro conserve cette information sur ce Mac. Les résultats ne couvrent que les connexions que ce client peut atteindre, qu'il soit donné ou non le connection_id.
ko: TablePro가 이 Mac에 보관하는 쿼리 기록을 검색합니다. connection_id를 지정하든 하지 않든, 결과는 이 클라이언트가 접근할 수 있는 연결만 포함합니다.
tr: TablePro'nun bu Mac'te tuttuğu sorgu geçmişinde arama yapar. connection_id verilse de verilmese de sonuçlar yalnızca bu istemcinin erişebildiği bağlantıları kapsar.
vi: Tìm trong lịch sử truy vấn mà TablePro giữ trên máy Mac này. Kết quả chỉ gồm những kết nối mà client này truy cập được, dù có truyền connection_id hay không.
zh_hans: 搜索 TablePro 保存在这台 Mac 上的查询历史。无论是否给出 connection_id，结果都只涵盖此客户端可访问的连接。
zh_hant: 搜尋 TablePro 儲存在這台 Mac 上的查詢記錄。無論是否給出 connection_id，結果都只涵蓋此用戶端可存取的連線。

source: Try a different search term
fr: Essayez un terme de recherche différent
ko: 다른 검색어를 입력해 보십시오
vi: Thử từ khoá tìm kiếm khác
zh_hans: 尝试其他搜索词
zh_hant: 請嘗試其他搜尋字詞

source: Import rows into a table
fr: Importer des lignes dans une table
ko: 테이블로 행 가져오기
tr: Bir tabloya satır içe aktar
vi: Nhập hàng vào bảng
zh_hans: 将行导入表
zh_hant: 將列匯入資料表

source: This engine does not support creating databases.
fr: Ce moteur ne prend pas en charge la création de bases de données.
ko: 이 엔진은 데이터베이스 생성을 지원하지 않습니다.
tr: Bu motor veritabanı oluşturmayı desteklemiyor.
vi: Engine này không hỗ trợ tạo cơ sở dữ liệu.
zh_hans: 此引擎不支持创建数据库。
zh_hant: 此引擎不支援建立資料庫。

source: Sanitize formula-like values
fr: Sanitiser les valeurs semblables à des formules
ko: 수식 형태의 값 무해화
vi: Làm sạch giá trị giống công thức
zh_hans: 清理类公式值
zh_hant: 清理類公式值

source: Last 7 Days
fr: Derniers 7 jours
ko: 최근 7일
tr: Son 7 Gün
vi: 7 ngày qua
zh_hans: 最近 7 天
zh_hant: 最近 7 天
